podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SYSCON_LPC11Cxx.svd.xml
<!--
Devices using this peripheral: 
      LPC11Cxx
-->
      <peripheral>
         <?sourceFile "SYSCON_LPC11Cxx" ?>
         <name>SYSCON</name>
         <description>System configuration</description>
         <groupName>SYSCON</groupName>
         <headerStructName>SYSCON</headerStructName>
         <baseAddress>0x40048000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x70</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x94</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xD0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xE0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x150</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x174</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x208</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20C</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x230</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x3F4</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SYSMEMREMAP</name>
               <description>System memory remap</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x2</resetValue>
               <fields>
                  <field>
                     <name>MAP</name>
                     <description>System memory remap</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BOOT_LOADER_MODE_IN</name>
                           <description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_RAM_MODE_INTER</name>
                           <description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_FLASH_MODE_INT</name>
                           <description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRESETCTRL</name>
               <description>Peripheral reset control</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>SSP0_RST_N</name>
                     <description>SPI0 reset control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SPIO0RESET</name>
                           <description>Resets the SPI0 peripheral</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPIO0NORESET</name>
                           <description>SPI0 reset de-asserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C_RST_N</name>
                     <description>I2C reset control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>I2CRESET</name>
                           <description>Resets the I2C peripheral</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2CNORESET</name>
                           <description>I2C reset de-asserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSP1_RST_N</name>
                     <description>SPI1 reset control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SPI1RESET</name>
                           <description>Resets the SPI1 peripheral</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI2NORESET</name>
                           <description>SPI1 reset de-asserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAN_RST_N</name>
                     <description>C_CAN reset control. See Section 3.1 for part specific details</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CANRESET</name>
                           <description>Resets the C_CAN peripheral</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CANNORESET</name>
                           <description>C_CAN reset de-asserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCTRL</name>
               <description>System PLL control</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>MSEL</name>
                     <description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PSEL</name>
                     <description>Post divider ratio P. The division ratio is 2 x P</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>P_EQ_1</name>
                           <description>P = 1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_EQ_2</name>
                           <description>P = 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_EQ_4</name>
                           <description>P = 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_EQ_8</name>
                           <description>P = 8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLSTAT</name>
               <description>System PLL status</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>PLL lock status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PLL_NOT_LOCKED</name>
                           <description>PLL not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_LOCKED</name>
                           <description>PLL locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSOSCCTRL</name>
               <description>System oscillator control</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>BYPASS</name>
                     <description>Bypass system oscillator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOBYPASS</name>
                           <description>Oscillator is not bypassed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS_ENABLED_PLL_</name>
                           <description>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN and XTALOUT pins</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FREQRANGE</name>
                     <description>Determines frequency range for Low-power oscillator</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>1 - 20 MHz frequency range</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>15 - 25 MHz frequency range</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTOSCCTRL</name>
               <description>Watchdog oscillator control</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>DIVSEL</name>
                     <description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FREQSEL</name>
                     <description>Select watchdog oscillator analog output frequency (Fclkana)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0_6_MHZ</name>
                           <description>0.6 MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_05_MHZ</name>
                           <description>1.05 MHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_4_MHZ</name>
                           <description>1.4 MHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_75_MHZ</name>
                           <description>1.75 MHz</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_1_MHZ</name>
                           <description>2.1 MHz</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_4_MHZ</name>
                           <description>2.4 MHz</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_7_MHZ</name>
                           <description>2.7 MHz</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3_0_MHZ</name>
                           <description>3.0 MHz</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3_25_MHZ</name>
                           <description>3.25 MHz</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3_5_MHZ</name>
                           <description>3.5 MHz</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3_75_MHZ</name>
                           <description>3.75 MHz</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4_0_MHZ</name>
                           <description>4.0 MHz</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4_2_MHZ</name>
                           <description>4.2 MHz</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4_4_MHZ</name>
                           <description>4.4 MHz</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4_6_MHZ</name>
                           <description>4.6 MHz</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRCCTRL</name>
               <description>IRC control</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trim value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSRSTSTAT</name>
               <description>System reset status register</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>POR reset status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_POR_DETECTED_</name>
                           <description>No POR detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POR_DETECTED_WRITIN</name>
                           <description>POR detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>Status of the external RESET pin</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RESET_EVENT_DETEC</name>
                           <description>No RESET event detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET_DETECTED_WRIT</name>
                           <description>RESET detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Status of the Watchdog reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_WDT_RESET_DETECTE</name>
                           <description>No WDT reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_RESET_DETECTED_</name>
                           <description>WDT reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOD</name>
                     <description>Status of the Brown-out detect reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BOD_RESET_DETECTE</name>
                           <description>No BOD reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOD_RESET_DETECTED_</name>
                           <description>BOD reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRST</name>
                     <description>Status of the software system reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_SYSTEM_RESET_DETE</name>
                           <description>No System reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_RESET_DETECTE</name>
                           <description>System reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
